КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НаименованиеГИСа/КонтурЛогистика_НаименованиеГИСа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НаименованиеГИСа</name>
  <enumValues>
    <name>ЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ГИС_МТ</name>
  </enumValues>
  <enumValues>
    <name>ФГИС_Меркурий</name>
  </enumValues>
  <enumValues>
    <name>ФГИС_ЛК</name>
  </enumValues>
  <enumValues>
    <name>ФГИС_Зерно</name>
  </enumValues>
  <enumValues>
    <name>ФГИС_СеверныйЗавоз</name>
  </enumValues>
  <enumValues>
    <name>Иное</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НаименованиеГИСа/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция Сериализовать(Знач Значение) Экспорт
    
    Если Значение = ЕГАИС Тогда
        Возврат "01";
    ИначеЕсли Значение = ГИС_МТ Тогда
        Возврат "02";
    ИначеЕсли Значение = ФГИС_Меркурий Тогда
        Возврат "03";
    ИначеЕсли Значение = ФГИС_ЛК Тогда
        Возврат "04";
    ИначеЕсли Значение = ФГИС_Зерно Тогда
        Возврат "05";
    ИначеЕсли Значение = ФГИС_СеверныйЗавоз Тогда
        Возврат "06";    
    Иначе 
    	Возврат "99";    
    КонецЕсли;
    
 КонецФункции
 
Функция Десериализовать(Знач Значение) Экспорт
    
	Если Значение = "01" Тогда
		Возврат ЕГАИС;
	ИначеЕсли Значение = "02" Тогда
		Возврат ГИС_МТ;
	ИначеЕсли Значение = "03" Тогда
		Возврат ФГИС_Меркурий;
	ИначеЕсли Значение = "04" Тогда
		Возврат ФГИС_ЛК;
	ИначеЕсли Значение = "05" Тогда
		Возврат ФГИС_Зерно;
	ИначеЕсли Значение = "06" Тогда
		Возврат ФГИС_СеверныйЗавоз;	
	ИначеЕсли Значение = "99" Тогда	
		Возврат Иное;
	Иначе
        Возврат ПустаяСсылка();
    КонецЕсли;
    
КонецФункции 

#КонецЕсли
